print("**********************运算符***************")

print("**********************算数运算符***************")
-- + - * / % ^幂运算
print("加法运算符".. 1 + 2)
a = 1
b = 2
print(a + b)
print("123.4" + 1) --> 124.4 z会自动转成number

print("减法运算".. 1 - 2)
print("123.4" - 1)

print("**********************条件运算符***************")
-- > < >= <= == ~=
print (3 > 1)
print(3 < 1)
print(3 >= 1)
print(3 <= 1)
print(3 ~= 1)

print("**********************逻辑运算符***************")
-- &&  || !        C#
-- and or  not     Lua
print(true and false)
print(true and true)
print(true or false)
print (not true)

print("**********************位运算符***************")
-- 不支持

print("**********************三目运算符***************")
-- 不支持

local f = fxx
