print("********************数组***************")
a = {1, 2, 3, 4, "123", true, nil}
print(a[1]) -- 1
print(a[2]) -- 2
print(#a) -- 长度
-- 某一位变成null， 会影响#获取长度

print("*******************数组的遍历***************")
for i = 1, #a do
    print(a[i])
end

print("*******************二维数组***************")
a = {{1, 2, 3}, {4, 5, 6}}
print(a[1][1])
print(a[1][2])

print("*******************二维数组的遍历***************")
for i=1,#a do
    b = a[i]
    for j=1,#b do
        print(b[j])
    end
end

print("*******************自定义索引***************")
aa = {[0] = 1, 2, 3, 4, 5}
print(aa[0])